index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-12-02 Wed 18:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>My Emacs Configuration</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jean Gregory Verret">
</head>
<body>
<div id="content">
<header>
<h1 class="title">My Emacs Configuration</h1>
</header><p>
Here begins my <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html">init file</a>, the first one that will be loaded to
initialize <a href="https://https//www.gnu.org/software/emacs/">Emacs</a>.
</p>

<p>
I begin with the file header and
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">init.el --- My Emacs Config -*- lexical-binding: t; -*-</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Author: Jean Gregory Verret</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Url: https://github.com/medivhok/my-emacs-config</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">defconst</span> <span class="org-variable-name">medivhok:init-directory</span>
  (file-name-as-directory user-emacs-directory)
  <span class="org-doc">"The directory of the base init.el."</span>)
</pre>
</div>

<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8706667">1. Bootstrapping</a></li>
<li><a href="#org66f8a0e">2. EXWM</a></li>
<li><a href="#org59f5abc">3. User Interface</a></li>
<li><a href="#org663b252">4. Applications</a></li>
<li><a href="#org50995e4">5. IDEs</a></li>
<li><a href="#orgfd15dbe">6. Appendix</a>
<ul>
<li><a href="#org1ba0036">6.1. Export Scripts</a>
<ul>
<li><a href="#orge279762">6.1.1. Org Export Setup (<code>html-export.setup</code>)</a></li>
<li><a href="#orge941fce">6.1.2. The Build Script (<code>builddocs.sh</code>)</a></li>
<li><a href="#org69be62c">6.1.3. The Publish Script (<code>publish.el</code>)</a></li>
</ul>
</li>
<li><a href="#orgf9d860f">6.2. Tests Configurations</a>
<ul>
<li><a href="#org57f628e">6.2.1. The Cask File</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org8706667" class="outline-2">
<h2 id="org8706667"><span class="section-number-2">1</span> Bootstrapping</h2>
<div class="outline-text-2" id="text-1">
<p>
The <a href="./bootstrapping/">boostrapping configurations</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defconst</span> <span class="org-variable-name">medivhok:bootstrapping-directory</span>
  (file-name-as-directory
   (expand-file-name <span class="org-string">"bootstrapping"</span> medivhok:init-directory))
  <span class="org-doc">"The bootstrapping configurations directory."</span>)

(load-file (expand-file-name <span class="org-string">"init.el"</span>
                             medivhok:bootstrapping-directory))
</pre>
</div>
</div>
</div>

<div id="outline-container-org66f8a0e" class="outline-2">
<h2 id="org66f8a0e"><span class="section-number-2">2</span> EXWM</h2>
<div class="outline-text-2" id="text-2">
<p>
The <a href="./exwm/">Emacs X Window Manager configurations</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defconst</span> <span class="org-variable-name">medivhok:exwm-directory</span>
  (file-name-as-directory
   (expand-file-name <span class="org-string">"exwm"</span> medivhok:init-directory))
  <span class="org-doc">"The Emacs X Window Manager configurations directory."</span>)

(load-file (expand-file-name <span class="org-string">"init.el"</span>
                             medivhok:exwm-directory))
</pre>
</div>
</div>
</div>

<div id="outline-container-org59f5abc" class="outline-2">
<h2 id="org59f5abc"><span class="section-number-2">3</span> User Interface</h2>
<div class="outline-text-2" id="text-3">
<p>
The <a href="./user-interface/">user interface configurations</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defconst</span> <span class="org-variable-name">medivhok:user-interface-directory</span>
  (file-name-as-directory
   (expand-file-name <span class="org-string">"user-interface"</span> medivhok:init-directory))
  <span class="org-doc">"The user interface configurations directory."</span>)

(load-file (expand-file-name <span class="org-string">"init.el"</span>
                             medivhok:user-interface-directory))
</pre>
</div>
</div>
</div>

<div id="outline-container-org663b252" class="outline-2">
<h2 id="org663b252"><span class="section-number-2">4</span> Applications</h2>
<div class="outline-text-2" id="text-4">
<p>
The <a href="./applications/">applications configurations</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defconst</span> <span class="org-variable-name">medivhok:applications-directory</span>
  (file-name-as-directory
   (expand-file-name <span class="org-string">"applications"</span> medivhok:init-directory))
  <span class="org-doc">"The applications configurations directory."</span>)

(load-file (expand-file-name <span class="org-string">"init.el"</span>
                             medivhok:applications-directory))
</pre>
</div>
</div>
</div>

<div id="outline-container-org50995e4" class="outline-2">
<h2 id="org50995e4"><span class="section-number-2">5</span> IDEs</h2>
<div class="outline-text-2" id="text-5">
<p>
The <a href="./ides/">Integrated Development Environments configurations</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defconst</span> <span class="org-variable-name">medivhok:ides-directory</span>
  (file-name-as-directory
   (expand-file-name <span class="org-string">"ides"</span> medivhok:init-directory))
  <span class="org-doc">"The applications configurations directory."</span>)

(load-file (expand-file-name <span class="org-string">"init.el"</span>
                             medivhok:ides-directory))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd15dbe" class="outline-2">
<h2 id="orgfd15dbe"><span class="section-number-2">6</span> Appendix</h2>
<div class="outline-text-2" id="text-6">
</div>

<div id="outline-container-org1ba0036" class="outline-3">
<h3 id="org1ba0036"><span class="section-number-3">6.1</span> Export Scripts</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orge279762" class="outline-4">
<h4 id="orge279762"><span class="section-number-4">6.1.1</span> Org Export Setup (<code>html-export.setup</code>)</h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">:root</span> {
    <span class="org-variable-name">--main-bg-color</span>:   <span class="custom-16">#282c34</span>;
    <span class="org-variable-name">--alt-bg-color</span>:    <span class="custom-15">#21242b</span>;
    <span class="org-variable-name">--main-fg-color</span>:   <span class="custom-14">#bbc2cf</span>;
    <span class="org-variable-name">--alt-fg-color</span>:    <span class="custom-13">#5b6268</span>;
    <span class="org-variable-name">--grey-color</span>:      <span class="custom-12">#3f444a</span>;
    <span class="org-variable-name">--red-color</span>:       <span class="custom-11">#ff6c6b</span>;
    <span class="org-variable-name">--orange-color</span>:    <span class="custom-10">#da8548</span>;
    <span class="org-variable-name">--green-color</span>:     <span class="custom-9">#98be65</span>;
    <span class="org-variable-name">--teal-color</span>:      <span class="custom-8">#4db5bd</span>;
    <span class="org-variable-name">--yellow-color</span>:    <span class="custom-7">#ecbe7b</span>;
    <span class="org-variable-name">--blue-color</span>:      <span class="custom-6">#51afef</span>;
    <span class="org-variable-name">--dark-blue-color</span>: <span class="custom-5">#2257a0</span>;
    <span class="org-variable-name">--magenta-color</span>:   <span class="custom-4">#c678dd</span>;
    <span class="org-variable-name">--violet-color</span>:    <span class="custom-3">#a9a1e1</span>;
    <span class="org-variable-name">--cyan-color</span>:      <span class="custom-2">#46d9ff</span>;
    <span class="org-variable-name">--dark-cyan-color</span>: <span class="custom-1">#5699af</span>;
}

<span class="org-css-selector">pre.src </span>{
    <span class="org-css-property">background</span>: var(<span class="org-variable-name">--main-bg-color</span>);
    <span class="org-css-property">color</span>:<span class="custom-14">#bbc2cf</span>;
}

<span class="org-css-selector">pre span.org-builtin </span>{
    <span class="org-css-property">color</span>: var(<span class="org-variable-name">--magenta-color</span>);
    <span class="org-css-property">font-weight</span>: bold;
}

<span class="org-css-selector">pre span.org-string </span>{
    <span class="org-css-property">color</span>: var(<span class="org-variable-name">--teal-color</span>);
}

<span class="org-css-selector">pre span.org-keyword </span>{
    <span class="org-css-property">color</span>: var(<span class="org-variable-name">--blue-color</span>);
}

<span class="org-css-selector">pre span.org-variable-name </span>{<span class="org-css-property">color</span>:var(<span class="org-variable-name">--magenta-color</span>);}
<span class="org-css-selector">pre span.org-function-name </span>{<span class="org-css-property">color</span>:var(<span class="org-variable-name">--magenta-color</span>);}
<span class="org-css-selector">pre span.org-type </span>{<span class="org-css-property">color</span>:var(<span class="org-variable-name">--yellow-color</span>);}
<span class="org-css-selector">pre span.org-preprocessor </span>{<span class="org-css-property">color</span>:<span class="custom">#808080</span>;<span class="org-css-property">font-weight</span>:bold;}
<span class="org-css-selector">pre span.org-constant </span>{<span class="org-css-property">color</span>:var(<span class="org-variable-name">--violet-color</span>);}
<span class="org-css-selector">pre span.org-comment-delimiter </span>{<span class="org-css-property">color</span>:var(<span class="org-variable-name">--dark-cyan-color</span>);}
<span class="org-css-selector">pre span.org-comment </span>{<span class="org-css-property">color</span>:var(<span class="org-variable-name">--dark-cyan-color</span>);<span class="org-css-property">font-style</span>:italic}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org"><span class="org-comment"># -*- mode:org -*-</span>
<span class="org-org-meta-line">#+SETUPFILE: <a href="https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup">https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup</a></span>

<span class="org-org-meta-line">#+html_head: &lt;style&gt;</span>
<span class="org-org-meta-line">#+html_head:   &lt;&lt;html-export:css&gt;&gt;</span>
<span class="org-org-meta-line">#+html_head: &lt;/style&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge941fce" class="outline-4">
<h4 id="orge941fce"><span class="section-number-4">6.1.2</span> The Build Script (<code>builddocs.sh</code>)</h4>
<div class="outline-text-4" id="text-6-1-2">
<div class="org-src-container">
<pre class="src src-sh">emacs --batch --no-init-file --load publish.el --funcall toggle-debug-on-error --funcall medivhok-publish
</pre>
</div>
</div>
</div>

<div id="outline-container-org69be62c" class="outline-4">
<h4 id="org69be62c"><span class="section-number-4">6.1.3</span> The Publish Script (<code>publish.el</code>)</h4>
<div class="outline-text-4" id="text-6-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)
(package-initialize)
(<span class="org-keyword">unless</span> package-archive-contents
  (add-to-list 'package-archives '(<span class="org-string">"org"</span> . <span class="org-string">"https://orgmode.org/elpa/"</span>) t)
  (add-to-list 'package-archives '(<span class="org-string">"gnu"</span> . <span class="org-string">"https://elpa.gnu.org/packages/"</span>) t)
  (add-to-list 'package-archives '(<span class="org-string">"melpa"</span> . <span class="org-string">"https://melpa.org/packages/"</span>) t)
  (package-refresh-contents))
(<span class="org-keyword">dolist</span> (pkg '(dash projectile org-plus-contrib htmlize))
  (<span class="org-keyword">unless</span> (package-installed-p pkg)
    (package-install pkg)))

(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">medivhok-publish</span> ()
  <span class="org-doc">"Publish the blog to HTML."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((make-backup-files nil)
        (org-publish-project-alist
         '((<span class="org-string">"site"</span>
            <span class="org-builtin">:base-directory</span> <span class="org-string">"."</span>
            <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
            <span class="org-builtin">:recursive</span> nil
            <span class="org-builtin">:publishing-directory</span> <span class="org-string">"public/"</span>
            <span class="org-builtin">:publishing-function</span> org-html-publish-to-html)))
        (user-full-name <span class="org-string">"Jean Gregory Verret"</span>)
        (user-mail-address <span class="org-string">"gregory.verret@gmail.com"</span>)
        (org-export-creator-string
         <span class="org-string">"&lt;a href=\"https://www.gnu.org/software/emacs/\"&gt;Emacs&lt;/a&gt; (&lt;a href=\"https://orgmode.org\"&gt;Org&lt;/a&gt;)"</span>)
        (org-html-html5-fancy t)
        (org-html-doctype <span class="org-string">"html5"</span>)
        (org-html-htmlize-output-type 'css))
    (org-publish-all)))

(<span class="org-keyword">provide</span> '<span class="org-constant">publish</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">publish.el ends here</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9d860f" class="outline-3">
<h3 id="orgf9d860f"><span class="section-number-3">6.2</span> Tests Configurations</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org57f628e" class="outline-4">
<h4 id="org57f628e"><span class="section-number-4">6.2.1</span> The Cask File</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
The <code>Cask</code> file will fetch the dependencies for our tests like <a href="https://github.com/jorgenschaefer/emacs-buttercup">buttercup</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb7f4f5e">(source gnu)
(source melpa-stable)

(development
 &lt;&lt;tests:dependencies&gt;&gt;
 (depends-on <span class="org-string">"buttercup"</span>))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jean Gregory Verret</p>
<p class="date">Created: 2020-12-02 Wed 18:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
